***Anno Accademico 2020/21 Foundations of Computer Science***

*Alice Calvi 818100*

*Salma Chabib 872519*

*Alessandra Maggipinto 872562*

*Abbiamo importato le librerie*

In [4]:
import pandas as pd
import re
import numpy as np

*Facciamo read csv di tutti i dataframe*

In [ ]:
def to_normalize (column_value):
    
    for university in school_and_country['school_name']:
        if column_value == university:
            return column_value
        
    pattern = re.compile(column_value)
    for university in school_and_country['university_name']:
        occurrence = pattern.search(university)
        if occurrence:
            return university
        else:
            reverse_pattern = re.compile(university)
            reverse_occurrence =reverse_pattern.search(column_value)
            if reverse_occurrence:
                return university

In [5]:
timesData = pd.read_csv("dataframe/timesData.csv")
timesData ['year'] = pd.to_datetime(timesData['year'], format = '%Y')
timesData.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011-01-01
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011-01-01
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011-01-01
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011-01-01
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011-01-01

In [6]:
timesData.replace(to_replace = '-', value = np.nan, inplace = True)
timesData.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011-01-01
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011-01-01
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011-01-01
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011-01-01
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,NaN,94.2,"7,929",8.4,27%,45 : 55,2011-01-01

In [7]:
shanghaiData = pd.read_csv("dataframe/shanghaiData.csv")
shanghaiData ['year'] = pd.to_datetime(shanghaiData['year'], format = '%Y')
shanghaiData.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005-01-01
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005-01-01
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005-01-01
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005-01-01
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005-01-01

In [8]:
school_and_country = pd.read_csv("dataframe/school_and_country_table.csv")
school_and_country.head()

                             school_name                   country
0                     Harvard University  United States of America
1     California Institute of Technology  United States of America
2  Massachusetts Institute of Technology  United States of America
3                    Stanford University  United States of America
4                   Princeton University  United States of America

In [151]:
cwurData = pd.read_csv("dataframe/cwurData.csv")
cwurData ['year'] = pd.to_datetime(cwurData['year'], format = '%Y')
cwurData.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012-01-01
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012-01-01
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012-01-01
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012-01-01
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012-01-01

In [119]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [8]:
education_expenditure = pd.read_csv("dataframe/education_expenditure_supplementary_data.csv",engine='python')
education_expenditure.head()

,country,institute_type,direct_expenditure_type,1995,2000,2005,2009,2010,2011
0,OECD Average,All Institutions,Public,4.9,4.9,5.0,5.4,5.4,5.3
1,Australia,All Institutions,Public,4.5,4.6,4.3,4.5,4.6,4.3
2,Austria,All Institutions,Public,5.3,5.4,5.2,5.7,5.6,5.5
3,Belgium,All Institutions,Public,5.0,5.1,5.8,6.4,6.4,6.4
4,Canada,All Institutions,Public,5.8,5.2,4.8,5.0,5.2,NaN

In [9]:
timesData.info() #per controllare il tipo delle variabili

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2594 non-null   object
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2385 non-null   object
 8   total_score             1201 non-null   object
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2367 non-null   object
 13  year                    2603 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(4), object(9)
memory usage: 284.8+ KB

In [9]:
timesData['income']=timesData['income'].astype(float) #da object me lo trasforma in float64

### 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframe

*A partire dal dataframe 'Times', raggruppiamo per 'university_name', estraiamo l'anno e prendiamo il massimo ovvero quello più recente in più abbiamo settato come indice il nome delle università*

In [10]:
most_recent_data=timesData.iloc[(timesData.groupby('university_name')['year'].idxmax())]

In [13]:
#controllo se i nomi delle università sono scritti bene
most_recent_data['university_name'] = most_recent_data['university_name'].unique()
università_times = most_recent_data['university_name'].to_list()
school_and_country['school_name'] = school_and_country['school_name'].unique()
università= school_and_country['school_name'].to_list()
len(università_times)

<ipython-input-13-5b36f1cef36b>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  most_recent_data['university_name'] = most_recent_data['university_name'].unique()

818

In [14]:
c = 0
for nome in università_times:
    for university in università:
        if nome == university:
            c+=1
c

818

In [ ]:
most_recent_data.set_index('university_name', inplace = True) 
most_recent_data.head()

*A partire dal dataframe 'Times', raggruppiamo per 'university_name', estraiamo l'anno e prendiamo il minimo ovvero quello meno recente in più abbiamo settato come indice il nome delle università*

In [12]:
least_recent_data=timesData.iloc[(timesData.groupby('university_name')['year'].idxmin())]
least_recent_data.set_index('university_name', inplace = True) 
least_recent_data.head()

,world_rank,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
university_name,,,,,,,,,,,,,
AGH University of Science and Technology,601-800,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,1%,NaN,2016-01-01
Aalborg University,301-350,Denmark,19.0,75.3,20.0,27.1,36.4,NaN,"17,422",15.9,15%,48 : 52,2012-01-01
Aalto University,301-350,Finland,26.2,49.0,22.2,37.5,61.9,NaN,"16,099",24.2,17%,32 : 68,2012-01-01
Aarhus University,167,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011-01-01
Aberystwyth University,276-300,United Kingdom,19.8,63.8,15.5,56.6,35.5,NaN,"9,252",19.2,18%,48 : 52,2012-01-01

### 2. For each university, compute the improvement in "income" between the least recent and the most recent data points

*Facciamo il merge delle 2 tabelle precedentemente ottenute usando 'university_name'*

In [13]:
punto2=pd.merge(most_recent_data, least_recent_data, on='university_name')
punto2.head()

,world_rank_x,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,student_staff_ratio_x,...,international_y,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y
university_name,,,,,,,,,,,,,,,,,,,,,
AGH University of Science and Technology,601-800,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,...,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,1%,NaN,2016-01-01
Aalborg University,201-250,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",15.9,...,75.3,20.0,27.1,36.4,NaN,"17,422",15.9,15%,48 : 52,2012-01-01
Aalto University,251-300,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",24.2,...,49.0,22.2,37.5,61.9,NaN,"16,099",24.2,17%,32 : 68,2012-01-01
Aarhus University,=106,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,...,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011-01-01
Aberystwyth University,301-350,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",19.2,...,63.8,15.5,56.6,35.5,NaN,"9,252",19.2,18%,48 : 52,2012-01-01

In [14]:
punto2.columns

Index(['world_rank_x', 'country_x', 'teaching_x', 'international_x',
       'research_x', 'citations_x', 'income_x', 'total_score_x',
       'num_students_x', 'student_staff_ratio_x', 'international_students_x',
       'female_male_ratio_x', 'year_x', 'world_rank_y', 'country_y',
       'teaching_y', 'international_y', 'research_y', 'citations_y',
       'income_y', 'total_score_y', 'num_students_y', 'student_staff_ratio_y',
       'international_students_y', 'female_male_ratio_y', 'year_y'],
      dtype='object')

*Rinominato le colonne di interesse*

In [15]:
punto2=punto2.rename(columns={'income_x':'income_most_recent','income_y':'income_least_recent'})
punto2.head()

,world_rank_x,country_x,teaching_x,international_x,research_x,citations_x,income_most_recent,total_score_x,num_students_x,student_staff_ratio_x,...,international_y,research_y,citations_y,income_least_recent,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y
university_name,,,,,,,,,,,,,,,,,,,,,
AGH University of Science and Technology,601-800,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,...,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,1%,NaN,2016-01-01
Aalborg University,201-250,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",15.9,...,75.3,20.0,27.1,36.4,NaN,"17,422",15.9,15%,48 : 52,2012-01-01
Aalto University,251-300,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",24.2,...,49.0,22.2,37.5,61.9,NaN,"16,099",24.2,17%,32 : 68,2012-01-01
Aarhus University,=106,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,...,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011-01-01
Aberystwyth University,301-350,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",19.2,...,63.8,15.5,56.6,35.5,NaN,"9,252",19.2,18%,48 : 52,2012-01-01

*Calcolo dell'income improvement*

In [16]:
punto2['income_improvement']=punto2['income_most_recent']-punto2['income_least_recent']
punto2.head()

,world_rank_x,country_x,teaching_x,international_x,research_x,citations_x,income_most_recent,total_score_x,num_students_x,student_staff_ratio_x,...,research_y,citations_y,income_least_recent,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y,income_improvement
university_name,,,,,,,,,,,,,,,,,,,,,
AGH University of Science and Technology,601-800,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,...,3.7,35.7,NaN,NaN,"35,569",17.0,1%,NaN,2016-01-01,NaN
Aalborg University,201-250,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",15.9,...,20.0,27.1,36.4,NaN,"17,422",15.9,15%,48 : 52,2012-01-01,7.3
Aalto University,251-300,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",24.2,...,22.2,37.5,61.9,NaN,"16,099",24.2,17%,32 : 68,2012-01-01,-0.3
Aarhus University,=106,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,...,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011-01-01,6.8
Aberystwyth University,301-350,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",19.2,...,15.5,56.6,35.5,NaN,"9,252",19.2,18%,48 : 52,2012-01-01,-4.2

In [17]:
punto2['income_improvement']

university_name
AGH University of Science and Technology     NaN
Aalborg University                           7.3
Aalto University                            -0.3
Aarhus University                            6.8
Aberystwyth University                      -4.2
                                            ...
École Normale Supérieure                     6.4
École Normale Supérieure de Lyon             5.6
École Polytechnique                          NaN
École Polytechnique Fédérale de Lausanne    27.4
Örebro University                            0.0
Name: income_improvement, Length: 818, dtype: float64

### 3. Find the university with the largest increase computed in the previous point

*Prendiamo l'università con income improvement più elevato*

In [23]:
#punto2.loc[punto2['income_improvement']>= punto2['income_improvement'].max()] 
punto2['income_improvement'].loc[punto2['income_improvement']>= punto2['income_improvement'].max()]

university_name
TU Dresden    67.8
Name: income_improvement, dtype: float64

### 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

*Per 'ShanghaiData' e 'CwurData' abbiamo raggruppato per il nome delle università e poi abbiamo estratto le righe con l'anno più recente*

In [24]:
most_recent_s=shanghaiData.iloc[(shanghaiData.groupby('university_name')['year'].idxmax())].copy()
most_recent_c=cwurData.iloc[(cwurData.groupby('institution')['year'].idxmax())].copy()
most_recent_t=timesData.iloc[(timesData.groupby('university_name')['year'].idxmax())].copy()

In [25]:
lista_t = most_recent_t['world_rank']
df_t =pd.DataFrame(lista_t)

# Abbiamo "spezzato" il range in modo da avere i due valori separati usando le espressioni regolari
df_t['min_range'] = df_t['world_rank'].str.extract(r'^\=?(\d+)')
df_t['max_range'] = df_t['world_rank'].str.extract(r'(\d+$)')

df_t[['min_range','max_range']]=df_t[['min_range','max_range']].astype(float)

most_recent_t['world_rank_t'] = (df_t['max_range'] + df_t['min_range'])//2
most_recent_t.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_t
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",17.0,1%,NaN,2016-01-01,700.0
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",15.9,15%,48 : 52,2016-01-01,225.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",24.2,17%,32 : 68,2016-01-01,275.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016-01-01,106.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",19.2,18%,48 : 52,2016-01-01,325.0

In [26]:
#rifacciamo per s
lista_s = most_recent_s['world_rank']
df_s =pd.DataFrame(lista_s)

df_s['min_range'] = df_s['world_rank'].str.extract(r'^\=?(\d+)')
df_s['max_range'] = df_s['world_rank'].str.extract(r'(\d+$)')

df_s[['min_range','max_range']]=df_s[['min_range','max_range']].astype(float)


most_recent_s['world_rank_s'] = (df_s['max_range'] + df_s['min_range'])//2
most_recent_s.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,world_rank_s
4697,301-400,Aalborg University,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015-01-01,350.0
4797,401-500,Aalto University,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015-01-01,450.0
4469,73,Aarhus University,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015-01-01,73.0
4497,101-150,Aix Marseille University,5-6,NaN,13.6,0.0,15.2,20.3,50.1,27.6,2015-01-01,125.0
3115,102-150,Aix-Marseille University,4-6,NaN,15.6,0.0,16.1,22.4,44.3,15.3,2011-01-01,126.0

In [27]:
most_recent_c.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1024 entries, 1981 to 1838
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            1024 non-null   int64
 1   institution           1024 non-null   object
 2   country               1024 non-null   object
 3   national_rank         1024 non-null   int64
 4   quality_of_education  1024 non-null   int64
 5   alumni_employment     1024 non-null   int64
 6   quality_of_faculty    1024 non-null   int64
 7   publications          1024 non-null   int64
 8   influence             1024 non-null   int64
 9   citations             1024 non-null   int64
 10  broad_impact          1023 non-null   float64
 11  patents               1024 non-null   int64
 12  score                 1024 non-null   float64
 13  year                  1024 non-null   datetime64[ns]
dtypes: datetime64[ns](1), float64(2), int64(9), object(2)
memory usage: 120.0+ KB

In [28]:
most_recent_c.rename(columns={'world_rank':'world_rank_c'}, inplace=True)
most_recent_c.head()

,world_rank_c,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1981,782,AGH University of Science and Technology,Poland,4,267,279,218,708,891,511,896.0,398,44.26,2015-01-01
1764,565,Aalborg University,Denmark,5,367,439,218,596,660,287,520.0,401,44.59,2015-01-01
1620,421,Aalto University,Finland,4,367,224,218,336,403,645,424.0,246,45.10,2015-01-01
1321,122,Aarhus University,Denmark,2,310,165,106,91,81,101,95.0,154,49.65,2015-01-01
2013,814,Aberystwyth University,United Kingdom,59,367,567,218,842,552,511,754.0,607,44.22,2015-01-01

In [29]:
primo_merge = pd.merge(most_recent_t, most_recent_s, on='university_name', how='left' , suffixes = ('_times','_shanghai'))
primo_merge

,world_rank_times,university_name,country,teaching,international,research,citations,income,total_score_times,num_students,...,national_rank,total_score_shanghai,alumni,award,hici,ns,pub,pcp,year_shanghai,world_rank_s
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaN
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",...,5,NaN,0.0,0.0,11.2,4.6,30.4,16.8,2015-01-01,350.0
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",...,4-6,NaN,0.0,0.0,0.0,10.4,33.4,17.0,2015-01-01,450.0
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,2,27.3,11.5,22.1,12.3,25.8,51.8,31.0,2015-01-01,73.0
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
813,54,École Normale Supérieure,France,70.6,85.5,47.7,87.1,37.1,69.0,"2,400",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaN
814,201-250,École Normale Supérieure de Lyon,France,41.6,65.6,30.0,69.0,31.7,NaN,"2,218",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaN
815,=101,École Polytechnique,France,53.5,92.8,44.6,64.7,82.3,57.9,"2,429",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaN
816,31,École Polytechnique Fédérale de Lausanne,Switzerland,61.3,98.6,67.5,94.6,65.4,76.1,"9,666",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaN
817,301-350,Örebro University,Sweden,18.3,39.4,10.4,87.8,29.8,NaN,"8,788",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT,NaN

In [30]:
secondo_merge = pd.merge(primo_merge, most_recent_c, left_on= 'university_name', right_on = 'institution', how='left')
secondo_merge

,world_rank_times,university_name,country_x,teaching,international,research,citations_x,income,total_score_times,num_students,...,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations_y,broad_impact,patents,score,year
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",...,267.0,279.0,218.0,708.0,891.0,511.0,896.0,398.0,44.26,2015-01-01
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",...,367.0,439.0,218.0,596.0,660.0,287.0,520.0,401.0,44.59,2015-01-01
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",...,367.0,224.0,218.0,336.0,403.0,645.0,424.0,246.0,45.10,2015-01-01
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,310.0,165.0,106.0,91.0,81.0,101.0,95.0,154.0,49.65,2015-01-01
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",...,367.0,567.0,218.0,842.0,552.0,511.0,754.0,607.0,44.22,2015-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
813,54,École Normale Supérieure,France,70.6,85.5,47.7,87.1,37.1,69.0,"2,400",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
814,201-250,École Normale Supérieure de Lyon,France,41.6,65.6,30.0,69.0,31.7,NaN,"2,218",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
815,=101,École Polytechnique,France,53.5,92.8,44.6,64.7,82.3,57.9,"2,429",...,98.0,7.0,216.0,327.0,314.0,234.0,295.0,172.0,59.20,2015-01-01
816,31,École Polytechnique Fédérale de Lausanne,Switzerland,61.3,98.6,67.5,94.6,65.4,76.1,"9,666",...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaT
817,301-350,Örebro University,Sweden,18.3,39.4,10.4,87.8,29.8,NaN,"8,788",...,367.0,529.0,218.0,816.0,747.0,428.0,549.0,871.0,44.44,2015-01-01

In [31]:
secondo_merge.columns

Index(['world_rank_times', 'university_name', 'country_x', 'teaching',
       'international', 'research', 'citations_x', 'income',
       'total_score_times', 'num_students', 'student_staff_ratio',
       'international_students', 'female_male_ratio', 'year_times',
       'world_rank_t', 'world_rank_shanghai', 'national_rank_x',
       'total_score_shanghai', 'alumni', 'award', 'hici', 'ns', 'pub', 'pcp',
       'year_shanghai', 'world_rank_s', 'world_rank_c', 'institution',
       'country_y', 'national_rank_y', 'quality_of_education',
       'alumni_employment', 'quality_of_faculty', 'publications', 'influence',
       'citations_y', 'broad_impact', 'patents', 'score', 'year'],
      dtype='object')

In [32]:
secondo_merge.rename(columns={'year':'year_cwur'}, inplace=True)
secondo_merge.head()

,world_rank_times,university_name,country_x,teaching,international,research,citations_x,income,total_score_times,num_students,...,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations_y,broad_impact,patents,score,year_cwur
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,NaN,NaN,"35,569",...,267.0,279.0,218.0,708.0,891.0,511.0,896.0,398.0,44.26,2015-01-01
1,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",...,367.0,439.0,218.0,596.0,660.0,287.0,520.0,401.0,44.59,2015-01-01
2,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",...,367.0,224.0,218.0,336.0,403.0,645.0,424.0,246.0,45.10,2015-01-01
3,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",...,310.0,165.0,106.0,91.0,81.0,101.0,95.0,154.0,49.65,2015-01-01
4,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",...,367.0,567.0,218.0,842.0,552.0,511.0,754.0,607.0,44.22,2015-01-01

In [33]:
#trovo il world rank massimo e minimo tra i 3 rankings
secondo_merge['HighScore'] = secondo_merge[['world_rank_t','world_rank_c','world_rank_s']].max(axis = 1)
secondo_merge['LowScore'] = secondo_merge[['world_rank_t','world_rank_c','world_rank_s']].min(axis = 1)

#calcolo
secondo_merge['maximum_difference'] = secondo_merge['HighScore']-secondo_merge['LowScore']
secondo_merge[['university_name','maximum_difference','HighScore','LowScore','world_rank_t','world_rank_c','world_rank_s']]

,university_name,maximum_difference,HighScore,LowScore,world_rank_t,world_rank_c,world_rank_s
0,AGH University of Science and Technology,82.0,782.0,700.0,700.0,782.0,NaN
1,Aalborg University,340.0,565.0,225.0,225.0,565.0,350.0
2,Aalto University,175.0,450.0,275.0,275.0,421.0,450.0
3,Aarhus University,49.0,122.0,73.0,106.0,122.0,73.0
4,Aberystwyth University,489.0,814.0,325.0,325.0,814.0,NaN
...,...,...,...,...,...,...,...
813,École Normale Supérieure,0.0,54.0,54.0,54.0,NaN,NaN
814,École Normale Supérieure de Lyon,0.0,225.0,225.0,225.0,NaN,NaN
815,École Polytechnique,65.0,101.0,36.0,101.0,36.0,NaN
816,École Polytechnique Fédérale de Lausanne,0.0,31.0,31.0,31.0,NaN,NaN
817,Örebro University,314.0,639.0,325.0,325.0,639.0,NaN

### 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.

In [34]:
most_recent_t.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 818 entries, 2405 to 2134
Data columns (total 15 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              818 non-null    object
 1   university_name         818 non-null    object
 2   country                 818 non-null    object
 3   teaching                818 non-null    float64
 4   international           818 non-null    object
 5   research                818 non-null    float64
 6   citations               818 non-null    float64
 7   income                  774 non-null    float64
 8   total_score             202 non-null    object
 9   num_students            796 non-null    object
 10  student_staff_ratio     796 non-null    float64
 11  international_students  793 non-null    object
 12  female_male_ratio       739 non-null    object
 13  year                    818 non-null    datetime64[ns]
 14  world_rank_t            818 non-null    float64
dtypes: datetime64[ns](1), float64(6), object(8)
memory usage: 102.2+ KB

*Estraiamo le proporzioni per female e male usando le espressioni regolari*

In [35]:
most_recent_t.dropna(subset=['num_students'], axis=0, inplace=True)
most_recent_t.dropna(subset=['female_male_ratio'], axis=0, inplace=True)

In [36]:
most_recent_t['female'] = most_recent_t['female_male_ratio'].str.extract(r'(^\d+)')
most_recent_t['male'] = most_recent_t['female_male_ratio'].str.extract(r'(\d+$)')
most_recent_t.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_t,female,male
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,"17,422",15.9,15%,48 : 52,2016-01-01,225.0,48,52
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,"16,099",24.2,17%,32 : 68,2016-01-01,275.0,32,68
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016-01-01,106.0,54,46
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,"9,252",19.2,18%,48 : 52,2016-01-01,325.0,48,52
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,NaN,"40,633",15.6,1%,71 : 29,2016-01-01,700.0,71,29

In [37]:
most_recent_t.info() #notiamo che female e male sono di tipo 'object'

<class 'pandas.core.frame.DataFrame'>
Int64Index: 739 entries, 2003 to 2134
Data columns (total 17 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              739 non-null    object
 1   university_name         739 non-null    object
 2   country                 739 non-null    object
 3   teaching                739 non-null    float64
 4   international           739 non-null    object
 5   research                739 non-null    float64
 6   citations               739 non-null    float64
 7   income                  706 non-null    float64
 8   total_score             181 non-null    object
 9   num_students            739 non-null    object
 10  student_staff_ratio     739 non-null    float64
 11  international_students  737 non-null    object
 12  female_male_ratio       739 non-null    object
 13  year                    739 non-null    datetime64[ns]
 14  world_rank_t            739 non-null    float64
 15  female                  739 non-null    object
 16  male                    739 non-null    object
dtypes: datetime64[ns](1), float64(6), object(10)
memory usage: 103.9+ KB

In [38]:
most_recent_t[['male','female']]=most_recent_t[['male','female']].astype(float)

In [39]:
most_recent_t.info() #ora notiamo che female e male sono di tipo 'float64' (anche num_students che verrà castato di seguito)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 739 entries, 2003 to 2134
Data columns (total 17 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              739 non-null    object
 1   university_name         739 non-null    object
 2   country                 739 non-null    object
 3   teaching                739 non-null    float64
 4   international           739 non-null    object
 5   research                739 non-null    float64
 6   citations               739 non-null    float64
 7   income                  706 non-null    float64
 8   total_score             181 non-null    object
 9   num_students            739 non-null    object
 10  student_staff_ratio     739 non-null    float64
 11  international_students  737 non-null    object
 12  female_male_ratio       739 non-null    object
 13  year                    739 non-null    datetime64[ns]
 14  world_rank_t            739 non-null    float64
 15  female                  739 non-null    float64
 16  male                    739 non-null    float64
dtypes: datetime64[ns](1), float64(8), object(8)
memory usage: 103.9+ KB

*Abbiamo tolto la virgola delle migliaia*

In [40]:
most_recent_t['num_students'] = most_recent_t['num_students'].str.replace(',','')
most_recent_t['num_students']=most_recent_t['num_students'].astype(float)
most_recent_t.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_t,female,male
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,17422.0,15.9,15%,48 : 52,2016-01-01,225.0,48.0,52.0
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,16099.0,24.2,17%,32 : 68,2016-01-01,275.0,32.0,68.0
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016-01-01,106.0,54.0,46.0
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,9252.0,19.2,18%,48 : 52,2016-01-01,325.0,48.0,52.0
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,NaN,40633.0,15.6,1%,71 : 29,2016-01-01,700.0,71.0,29.0

In [41]:
most_recent_t['num_male']= most_recent_t['male'] * most_recent_t['num_students'] // 100
most_recent_t['num_fem']= most_recent_t['female'] * most_recent_t['num_students'] // 100
#most_recent_t.groupby('country')['num_fem'].sum()
#most_recent_t.groupby('country')['num_male'].sum()
num_Donne_Uomini=most_recent_t.groupby('country')[['num_fem','num_male']].sum()
num_Donne_Uomini

                            num_fem   num_male
country
Argentina                   67191.0    41181.0
Australia                  391722.0   321624.0
Austria                     68362.0    66109.0
Bangladesh                  21323.0    41392.0
Belarus                     20219.0     9083.0
...                             ...        ...
Uganda                      18670.0    18670.0
Ukraine                     17845.0    19249.0
United Arab Emirates         9515.0     4930.0
United Kingdom             711775.0   612993.0
United States of America  1601393.0  1556253.0

[70 rows x 2 columns]

### 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

*Calcoliamo totale di uomini e donne in tutto il dataframe*

In [42]:
total_females = most_recent_t['num_fem'].sum()

total_males= most_recent_t['num_male'].sum()

*calcolo dell' average ratio*

In [43]:
avg_ratio= (total_females/total_males)  
avg_ratio

1.0709956150614703

In [44]:
most_recent_t['ratio']=most_recent_t['num_fem']/most_recent_t['num_male'] #rapporto per ogni riga
most_recent_t.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_t,female,male,num_male,num_fem,ratio
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,17422.0,15.9,15%,48 : 52,2016-01-01,225.0,48.0,52.0,9059.0,8362.0,0.923060
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,16099.0,24.2,17%,32 : 68,2016-01-01,275.0,32.0,68.0,10947.0,5151.0,0.470540
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,23895.0,13.6,14%,54 : 46,2016-01-01,106.0,54.0,46.0,10991.0,12903.0,1.173961
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,9252.0,19.2,18%,48 : 52,2016-01-01,325.0,48.0,52.0,4811.0,4440.0,0.922885
2404,601-800,Adam Mickiewicz University,Poland,20.0,25.7,11.0,15.3,28.7,NaN,40633.0,15.6,1%,71 : 29,2016-01-01,700.0,71.0,29.0,11783.0,28849.0,2.448358

*Confrontiamo e prendiamo quelli con rapporto minore della media*

In [47]:
punto6 = most_recent_t.loc[most_recent_t['ratio'] < avg_ratio]
punto6.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,world_rank_t,female,male,num_male,num_fem,ratio
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,NaN,17422.0,15.9,15%,48 : 52,2016-01-01,225.0,48.0,52.0,9059.0,8362.0,0.923060
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,NaN,16099.0,24.2,17%,32 : 68,2016-01-01,275.0,32.0,68.0,10947.0,5151.0,0.470540
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,NaN,9252.0,19.2,18%,48 : 52,2016-01-01,325.0,48.0,52.0,4811.0,4440.0,0.922885
2406,601-800,Ajou University,South Korea,19.5,20.0,11.9,23.9,45.7,NaN,12706.0,11.3,2%,33 : 67,2016-01-01,700.0,33.0,67.0,8513.0,4192.0,0.492423
2408,601-800,Alexandria University,Egypt,20.3,33.7,8.2,14.1,29.7,NaN,127431.0,23.3,1%,46 : 54,2016-01-01,700.0,46.0,54.0,68812.0,58618.0,0.851857

*Estraiamo solo i nomi delle università che soddisfano il punto 6*

In [48]:
punto6[['university_name','ratio']]

                               university_name     ratio
2003                        Aalborg University  0.923060
2056                          Aalto University  0.470540
2105                    Aberystwyth University  0.922885
2406                           Ajou University  0.492423
2408                     Alexandria University  0.851857
...                                        ...       ...
2104                       Zhejiang University  0.694923
1856                  École Normale Supérieure  0.851852
2013          École Normale Supérieure de Lyon  0.960212
1904                       École Polytechnique  0.219488
1833  École Polytechnique Fédérale de Lausanne  0.369756

[346 rows x 2 columns]

### 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

*Estraiamo dal dataframe precedente le colonne di interesse*

In [66]:
punto7 = punto6[['university_name','country','num_students', 'female_male_ratio', 'year', 'male','female', 'num_male', 'num_fem', 'ratio']]
punto7

,university_name,country,num_students,female_male_ratio,year,male,female,num_male,num_fem,ratio
2003,Aalborg University,Denmark,17422.0,48 : 52,2016-01-01,52.0,48.0,9059.0,8362.0,0.923060
2056,Aalto University,Finland,16099.0,32 : 68,2016-01-01,68.0,32.0,10947.0,5151.0,0.470540
2105,Aberystwyth University,United Kingdom,9252.0,48 : 52,2016-01-01,52.0,48.0,4811.0,4440.0,0.922885
2406,Ajou University,South Korea,12706.0,33 : 67,2016-01-01,67.0,33.0,8513.0,4192.0,0.492423
2408,Alexandria University,Egypt,127431.0,46 : 54,2016-01-01,54.0,46.0,68812.0,58618.0,0.851857
...,...,...,...,...,...,...,...,...,...,...
2104,Zhejiang University,China,47508.0,41 : 59,2016-01-01,59.0,41.0,28029.0,19478.0,0.694923
1856,École Normale Supérieure,France,2400.0,46 : 54,2016-01-01,54.0,46.0,1296.0,1104.0,0.851852
2013,École Normale Supérieure de Lyon,France,2218.0,49 : 51,2016-01-01,51.0,49.0,1131.0,1086.0,0.960212
1904,École Polytechnique,France,2429.0,18 : 82,2016-01-01,82.0,18.0,1991.0,437.0,0.219488
1833,École Polytechnique Fédérale de Lausanne,Switzerland,9666.0,27 : 73,2016-01-01,73.0,27.0,7056.0,2609.0,0.369756

*Raggruppiamo per nazione e facciamo la somma del numero di studenti in quella determinata nazione, infine estraiamo anche 'country' in modo da creare un dataframe*

In [69]:
number_students_per_country = punto7.groupby('country')[['num_students', 'country']].sum()
number_students_per_country.reset_index(inplace=True)
number_students_per_country

                     country  num_students
0                  Australia      146235.0
1                    Austria       61033.0
2                 Bangladesh       62716.0
3                     Brazil      278774.0
4                     Canada       86779.0
5                      Chile       90951.0
6                      China      885293.0
7                   Colombia       54645.0
8             Czech Republic       38685.0
9                    Denmark       45705.0
10                     Egypt      359372.0
11                   Estonia       14061.0
12                   Finland       39788.0
13                    France      156153.0
14                   Germany      435244.0
15                     Ghana       37274.0
16                    Greece       57198.0
17                 Hong Kong       32079.0
18                   Hungary       22447.0
19                     India      155370.0
20                 Indonesia       43565.0
21                      Iran      107280.0
22                    Israel       30550.0
23                     Italy      106471.0
24                     Japan      447415.0
25                     Kenya       72676.0
26                   Lebanon        7695.0
27                Luxembourg        5144.0
28                  Malaysia       16270.0
29                    Mexico      151731.0
30                   Morocco       56060.0
31               Netherlands       58883.0
32               New Zealand       12187.0
33                   Nigeria       26247.0
34                    Norway       17381.0
35                      Oman        7089.0
36                  Pakistan        9808.0
37                    Poland       59789.0
38                  Portugal       89285.0
39       Republic of Ireland       34597.0
40        Russian Federation      119356.0
41                 Singapore       56620.0
42                  Slovakia       16400.0
43               South Korea      276058.0
44                     Spain      136088.0
45                    Sweden       20667.0
46               Switzerland       34692.0
47                    Taiwan      209949.0
48                  Thailand       66058.0
49                    Turkey      216017.0
50                    Uganda       37340.0
51                   Ukraine       22686.0
52      United Arab Emirates        5226.0
53            United Kingdom      259977.0
54  United States of America     1726340.0

*Numero di studenti per università*

In [79]:
punto_7_numerat = punto7[['university_name', 'country', 'num_students']] 
punto_7_numerat

                               university_name         country  num_students
2003                        Aalborg University         Denmark       17422.0
2056                          Aalto University         Finland       16099.0
2105                    Aberystwyth University  United Kingdom        9252.0
2406                           Ajou University     South Korea       12706.0
2408                     Alexandria University           Egypt      127431.0
...                                        ...             ...           ...
2104                       Zhejiang University           China       47508.0
1856                  École Normale Supérieure          France        2400.0
2013          École Normale Supérieure de Lyon          France        2218.0
1904                       École Polytechnique          France        2429.0
1833  École Polytechnique Fédérale de Lausanne     Switzerland        9666.0

[346 rows x 3 columns]

In [80]:
tab_merge = pd.merge(punto_7_numerat, number_students_per_country, on = 'country', how='left', suffixes= ('_university','_country')) 
tab_merge.head()

,university_name,country,num_students_university,num_students_country
0,Aalborg University,Denmark,17422.0,45705.0
1,Aalto University,Finland,16099.0,39788.0
2,Aberystwyth University,United Kingdom,9252.0,259977.0
3,Ajou University,South Korea,12706.0,276058.0
4,Alexandria University,Egypt,127431.0,359372.0

*Calcoliamo la frazione*

In [82]:
tab_merge['fraction_of_students'] = tab_merge['num_students_university']/tab_merge['num_students_country']
tab_merge

,university_name,country,num_students_university,num_students_country,fraction_of_students
0,Aalborg University,Denmark,17422.0,45705.0,0.381184
1,Aalto University,Finland,16099.0,39788.0,0.404619
2,Aberystwyth University,United Kingdom,9252.0,259977.0,0.035588
3,Ajou University,South Korea,12706.0,276058.0,0.046027
4,Alexandria University,Egypt,127431.0,359372.0,0.354594
...,...,...,...,...,...
341,Zhejiang University,China,47508.0,885293.0,0.053664
342,École Normale Supérieure,France,2400.0,156153.0,0.015370
343,École Normale Supérieure de Lyon,France,2218.0,156153.0,0.014204
344,École Polytechnique,France,2429.0,156153.0,0.015555
345,École Polytechnique Fédérale de Lausanne,Switzerland,9666.0,34692.0,0.278623

### 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [84]:
educational_attainment = pd.read_csv("dataframe/educational_attainment_supplementary_data.csv")
educational_attainment.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [87]:
educ = educational_attainment[(educational_attainment['country_name'].notnull()) & (educational_attainment['series_name'].notnull())]
educ.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

### 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [95]:
pd.melt?

In [96]:
educ.columns[2:]

Index(['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005',
       '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2015'],
      dtype='object')

In [97]:
pd.melt(educ, id_vars=['country_name','series_name'], value_vars=['1985', '1986', '1987', '1990', '1991', '1992', '1993', '1995', '1996',
       '1997', '1998', '1999', '2000', '2001', '2002', '2003', '2004', '2005',
       '2006', '2007', '2008', '2009', '2010', '2011', '2012', '2013', '2015'])

,country_name,series_name,variable,value
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.33
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,1.03
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.83
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,2.34
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1985,0.54
...,...,...,...,...
2134345,Zimbabwe,UIS: Percentage of population age 25+ with som...,2015,NaN
2134346,Zimbabwe,UIS: Percentage of population age 25+ with som...,2015,NaN
2134347,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN
2134348,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN
2134349,Zimbabwe,UIS: Percentage of population age 25+ with unk...,2015,NaN

### 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

*Facciamo il merge di times cwur e shanghai e prendiamo solo le colonne di interesse*

In [137]:
#facciamo il merge di times cwur e shanghai e prendiamo solo le colonne di interesse
tabella_merge=pd.merge(timesData,cwurData,how='left', left_on='university_name', right_on='institution')
tabella_merge=pd.merge(tabella_merge,shanghaiData,how='left', on='university_name')
tabella_merge=tabella_merge.rename(columns={'world_rank':'world_rank_times','world_rank_x':'world_rank_cwur','world_rank_y':'world_rank_shanghai' })
tabella_merge=tabella_merge[['university_name','world_rank_times','world_rank_cwur','world_rank_shanghai']]
#rinominiamo
tabella_merge['world_rank_shanghai']=tabella_merge['world_rank_shanghai'].replace(np.nan, 'Dato mancante')
tabella_merge['world_rank_times']=tabella_merge['world_rank_times'].replace(np.nan, 'Dato mancante')
tabella_merge['world_rank_cwur']=tabella_merge['world_rank_cwur'].replace(np.nan, 'Dato mancante')

In [138]:
#definizione della funzione counter che mi conta quante volte il dato non è mancante
def counter(col1,col2,col3):
    count=0
    if (col1!='Dato mancante'):
        count+=1
    if (col2!='Dato mancante'):
        count+=1
    if (col3!='Dato mancante'):
        count+=1

    return count

In [153]:
#applicchiamo counter
tabella_merge['counter']=tabella_merge.apply(lambda x:counter(x.world_rank_times,x.world_rank_cwur,x.world_rank_shanghai), axis=1)
tabella_merge.drop_duplicates(subset=['university_name','counter'],keep='first')

,university_name,world_rank_times,world_rank_cwur,world_rank_shanghai,counter
0,Harvard University,1,1,1,3
44,California Institute of Technology,6,2,5,3
88,Massachusetts Institute of Technology,Dato mancante,3,2,2
92,Stanford University,3,4,3,3
136,Princeton University,8,5,6,3
...,...,...,...,...,...
35560,Xidian University,Dato mancante,601-800,980,2
35562,Yeungnam University,Dato mancante,601-800,776,2
35564,Yıldız Technical University,Dato mancante,601-800,Dato mancante,1
35565,Yokohama City University,Dato mancante,601-800,461,2
35567,Yokohama National University,Dato mancante,601-800,339,2

### 11. In the times ranking, compute the number of times each university appears

*Raggruppiamo per university_name, estraiamo world_rank e contiamo*

In [106]:
punto11 = timesData.groupby('university_name', as_index = False)['world_rank'].count()
punto11

                              university_name  world_rank
0    AGH University of Science and Technology           1
1                          Aalborg University           5
2                            Aalto University           5
3                           Aarhus University           6
4                      Aberystwyth University           5
..                                        ...         ...
813                  École Normale Supérieure           6
814          École Normale Supérieure de Lyon           6
815                       École Polytechnique           6
816  École Polytechnique Fédérale de Lausanne           6
817                         Örebro University           1

[818 rows x 2 columns]

### 12. Find the universities that appear at most twice in the times ranking.

In [107]:
punto12 = punto11[punto11['world_rank']<= 2]
punto12

                              university_name  world_rank
0    AGH University of Science and Technology           1
5                  Adam Mickiewicz University           1
6                    Aix-Marseille University           1
7                             Ajou University           1
9              Alexandru Ioan Cuza University           1
..                                        ...         ...
806                  Yokohama City University           1
807              Yokohama National University           1
810                        Yuan Ze University           2
811               Yıldız Technical University           1
817                         Örebro University           1

[408 rows x 2 columns]

### 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

*Facciamo il merge dei 3 dataframes*

In [108]:
punto13 = pd.merge(timesData, cwurData, left_on=['university_name','year'], right_on = ['institution','year'])
punto13= pd.merge(punto13, shanghaiData, on= ['university_name', 'year'])
punto13= punto13.rename(columns= {'world_rank_x':'world_rank_times','world_rank_y': 'world_rank_cwur','world_rank' : 'world_rank_shanghai'})

*Estraiamo le colonne di interesse*

In [109]:
punto13= punto13[['university_name','year','world_rank_times','world_rank_cwur','world_rank_shanghai']]
punto13.head()

,university_name,year,world_rank_times,world_rank_cwur,world_rank_shanghai
0,California Institute of Technology,2012-01-01,1,5,6
1,Harvard University,2012-01-01,2,1,1
2,Stanford University,2012-01-01,2,3,2
3,University of Oxford,2012-01-01,4,7,10
4,Princeton University,2012-01-01,5,6,7

In [110]:
punto13.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 551 entries, 0 to 550
Data columns (total 5 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   university_name      551 non-null    object
 1   year                 551 non-null    datetime64[ns]
 2   world_rank_times     551 non-null    object
 3   world_rank_cwur      551 non-null    int64
 4   world_rank_shanghai  551 non-null    object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 25.8+ KB

*Prendiamo solo le università per cui il world rank in Times è uguale al world rank in Shanghai*

In [111]:
punto13 = punto13.loc[(punto13['world_rank_times'] == punto13['world_rank_shanghai'])]
punto13

,university_name,year,world_rank_times,world_rank_cwur,world_rank_shanghai
2,Stanford University,2012-01-01,2,3,2
6,University of Chicago,2012-01-01,9,11,9
8,Yale University,2012-01-01,11,8,11
60,Stanford University,2013-01-01,2,2,2
67,Yale University,2013-01-01,11,10,11
70,University of Pennsylvania,2013-01-01,15,12,15
79,"University of California, Santa Barbara",2013-01-01,35,37,35
109,Princeton University,2014-01-01,6,9,6
111,University of Chicago,2014-01-01,9,8,9
112,Yale University,2014-01-01,11,10,11
113,"University of California, Los Angeles",2014-01-01,12,15,12
115,University of Pennsylvania,2014-01-01,16,14,16
331,University of Cambridge,2015-01-01,5,4,5
336,"University of California, Los Angeles",2015-01-01,12,15,12

*Controlliamo se world rank in Times è uguale a wolrd rank in Cwur*

In [113]:
punto13['world_rank_times']=punto13['world_rank_times'].astype(float)
punto13['world_rank_shanghai']=punto13['world_rank_shanghai'].astype(float)
punto13.loc[(punto13['world_rank_times'] == punto13['world_rank_cwur'])]

,university_name,year,world_rank_times,world_rank_cwur,world_rank_shanghai
60,Stanford University,2013-01-01,2.0,2,2.0